<a href="https://colab.research.google.com/github/antonioravila/Alura-Cursos/blob/main/Python_Pandas_tratando_e_analisando_dados_(PT2).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Relatório de Análise III

## Imóveis Residenciais

"Temos uma nova tarefa solicitada pela seguradora que contratou nossos serviços: com base no último relatório que entregamos, a empresa decidiu criar produtos apenas para imóveis residenciais. Dessa forma, precisamos criar uma nova base de dados que contenha somente imóveis dessa categoria."

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv('/content/aluguel.csv', sep = ';')

In [3]:
dados.head()

                      Tipo           Bairro  ...  Condominio    IPTU
0                Quitinete       Copacabana  ...       500.0    60.0
1                     Casa  Jardim Botânico  ...         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca  ...      4020.0  1111.0
3              Apartamento           Centro  ...       390.0    20.0
4              Apartamento     Higienópolis  ...       230.0     NaN

[5 rows x 9 columns]

In [4]:
"""
- para selecionar somente os imóveis residenciais, devo selecionar quais são os 
tipos correspondentes a tal caracteristica
- sendo assim, vou criar uma lista com os os valores únicos de tipos
- os dois métodos abaixo podem ser utilizados
"""
list(dados['Tipo'].drop_duplicates())

['Quitinete',
 'Casa',
 'Conjunto Comercial/Sala',
 'Apartamento',
 'Casa de Condomínio',
 'Prédio Inteiro',
 'Flat',
 'Loja/Salão',
 'Galpão/Depósito/Armazém',
 'Casa Comercial',
 'Casa de Vila',
 'Terreno Padrão',
 'Box/Garagem',
 'Loft',
 'Loja Shopping/ Ct Comercial',
 'Chácara',
 'Loteamento/Condomínio',
 'Sítio',
 'Pousada/Chalé',
 'Studio',
 'Hotel']

In [5]:
list(dados['Tipo'].unique())

['Quitinete',
 'Casa',
 'Conjunto Comercial/Sala',
 'Apartamento',
 'Casa de Condomínio',
 'Prédio Inteiro',
 'Flat',
 'Loja/Salão',
 'Galpão/Depósito/Armazém',
 'Casa Comercial',
 'Casa de Vila',
 'Terreno Padrão',
 'Box/Garagem',
 'Loft',
 'Loja Shopping/ Ct Comercial',
 'Chácara',
 'Loteamento/Condomínio',
 'Sítio',
 'Pousada/Chalé',
 'Studio',
 'Hotel']

In [6]:
# por meio das listas acima, vou criar uma lista somente com os residenciais
residencial = ['Quitinete',
 'Casa',
 'Apartamento',
 'Casa de Condomínio',
 'Casa de Vila']

In [7]:
residencial

['Quitinete', 'Casa', 'Apartamento', 'Casa de Condomínio', 'Casa de Vila']

In [8]:
#retorna uma série de valores booleanos, de acordo com a lista acima
selecao = dados['Tipo'].isin(residencial)

In [9]:
selecao

0         True
1         True
2        False
3         True
4         True
         ...
21108     True
21109     True
21110     True
21111     True
21112     True
Name: Tipo, Length: 21113, dtype: bool

In [10]:
# cria um novo dataset somente com os dados da seleção
dados_residencial = dados[selecao]

In [11]:
# Novo dataset, mas com index errado
dados_residencial

              Tipo           Bairro  Quartos  ...   Valor  Condominio    IPTU
0        Quitinete       Copacabana      1.0  ...  1700.0       500.0    60.0
1             Casa  Jardim Botânico      2.0  ...  7000.0         NaN     NaN
3      Apartamento           Centro      1.0  ...   800.0       390.0    20.0
4      Apartamento     Higienópolis      1.0  ...   800.0       230.0     NaN
5      Apartamento     Vista Alegre      3.0  ...  1200.0         NaN     NaN
...            ...              ...      ...  ...     ...         ...     ...
21108  Apartamento          Ipanema      4.0  ...  9500.0      3600.0  1500.0
21109  Apartamento           Tijuca      2.0  ...  1350.0       495.0    20.0
21110  Apartamento       Copacabana      3.0  ...  3700.0      1347.0   329.0
21111  Apartamento          Ipanema      3.0  ...  5000.0      1209.0   240.0
21112         Casa            Vicen      NaN  ...     NaN         NaN     NaN

[14400 rows x 9 columns]

In [12]:
dados_residencial.index = range(dados_residencial.shape[0])
dados_residencial

              Tipo           Bairro  Quartos  ...   Valor  Condominio    IPTU
0        Quitinete       Copacabana      1.0  ...  1700.0       500.0    60.0
1             Casa  Jardim Botânico      2.0  ...  7000.0         NaN     NaN
2      Apartamento           Centro      1.0  ...   800.0       390.0    20.0
3      Apartamento     Higienópolis      1.0  ...   800.0       230.0     NaN
4      Apartamento     Vista Alegre      3.0  ...  1200.0         NaN     NaN
...            ...              ...      ...  ...     ...         ...     ...
14395  Apartamento          Ipanema      4.0  ...  9500.0      3600.0  1500.0
14396  Apartamento           Tijuca      2.0  ...  1350.0       495.0    20.0
14397  Apartamento       Copacabana      3.0  ...  3700.0      1347.0   329.0
14398  Apartamento          Ipanema      3.0  ...  5000.0      1209.0   240.0
14399         Casa            Vicen      NaN  ...     NaN         NaN     NaN

[14400 rows x 9 columns]

In [13]:
"""
como posso checar se deu certo?
devo utilizar o método .drop_duplicates, e ver quais os valores unícos da 
coluna "Tipo"
"""

list(dados_residencial['Tipo'].drop_duplicates())

['Quitinete', 'Casa', 'Apartamento', 'Casa de Condomínio', 'Casa de Vila']

## Exportando

In [14]:
dados_residencial.to_csv('/content/dados_residencial.csv', sep = ';')

In [15]:
#nota-se que o index tá errado, pq esqueci de apagar na hora de importar
dados_residencialTeste = pd.read_csv('/content/dados_residencial.csv', sep = ';')
dados_residencialTeste.head(3)

   Unnamed: 0         Tipo           Bairro  ...   Valor  Condominio  IPTU
0           0    Quitinete       Copacabana  ...  1700.0       500.0  60.0
1           1         Casa  Jardim Botânico  ...  7000.0         NaN   NaN
2           2  Apartamento           Centro  ...   800.0       390.0  20.0

[3 rows x 10 columns]

In [16]:
dados_residencial.to_csv('/content/dados_residencial.csv', sep = ';', index = False)

In [17]:
dados_residencial = pd.read_csv('/content/dados_residencial.csv', sep = ';')

In [18]:
dados_residencial.head(10)

                 Tipo           Bairro  Quartos  ...    Valor  Condominio  IPTU
0           Quitinete       Copacabana      1.0  ...   1700.0       500.0  60.0
1                Casa  Jardim Botânico      2.0  ...   7000.0         NaN   NaN
2         Apartamento           Centro      1.0  ...    800.0       390.0  20.0
3         Apartamento     Higienópolis      1.0  ...    800.0       230.0   NaN
4         Apartamento     Vista Alegre      3.0  ...   1200.0         NaN   NaN
5         Apartamento         Cachambi      2.0  ...   1300.0       301.0  17.0
6  Casa de Condomínio  Barra da Tijuca      5.0  ...  22000.0         NaN   NaN
7  Casa de Condomínio            Ramos      2.0  ...   1000.0         NaN   NaN
8         Apartamento           Centro      1.0  ...   1200.0         NaN   NaN
9         Apartamento           Grajaú      2.0  ...   1500.0       642.0  74.0

[10 rows x 9 columns]

## (EXTRA III) Organizando DataFrames

In [19]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [20]:
colunas = ['X', 'Y', 'Z']

In [21]:
df = pd.DataFrame(data, list('321'), list('ZYX'))

In [22]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [23]:
df.sort_index(inplace=True)

In [24]:
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [25]:
df.sort_index(inplace=True, axis = 1)

In [26]:
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [27]:
df.sort_values(by = 'X', axis = 0, inplace = True)
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

# Relatório de Análise IV

## Seleções e Frequências


* Selecione somente os imóveis classificados com tipo 'Apartamento'.
* Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.
* Selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.
* Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.

In [28]:
dados_residencial.head()

          Tipo           Bairro  Quartos  ...   Valor  Condominio  IPTU
0    Quitinete       Copacabana      1.0  ...  1700.0       500.0  60.0
1         Casa  Jardim Botânico      2.0  ...  7000.0         NaN   NaN
2  Apartamento           Centro      1.0  ...   800.0       390.0  20.0
3  Apartamento     Higienópolis      1.0  ...   800.0       230.0   NaN
4  Apartamento     Vista Alegre      3.0  ...  1200.0         NaN   NaN

[5 rows x 9 columns]

In [29]:
#Selecione somente os imóveis classificados com tipo 'Apartamento'.
selecao = dados_residencial.query("Tipo=='Apartamento'")
selecao.shape[0]

12487

In [30]:
#Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.
selecao = dados_residencial.query("Tipo=='Casa' | Tipo=='Casa de Condomínio' | Tipo=='Casa de Vila'")
selecao.shape[0]

1394

In [31]:
#Selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.
#60 <= Area <=100
selecao = dados_residencial.query("Area >= 60 & Area <= 100")
selecao.shape[0]

5591

In [32]:
#Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.
selecao = dados_residencial.query("Quartos >= 4 & Valor < 2000")
selecao.shape[0]

24

## Exercício

In [33]:
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [34]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [35]:
aprovados = alunos.query('Aprovado==True')

In [36]:
aprovados

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [37]:
aprovados_mulheres = alunos.query('Aprovado==True & Sexo=="F"')

In [38]:
aprovados_mulheres

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [39]:
# Crie apenas uma visualização dos alunos com idade entre 10 e 20 anos ou com idade maior ou igual a 40 anos.
alunos.query('Idade >= 10 & Idade <= 20 | Idade >= 40')

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False

In [40]:
# Crie um DataFrame somente com os alunos reprovados e mantenha neste DataFrame apenas as colunas Nome, Sexo e Idade, nesta ordem.
reprovados = alunos.query('Aprovado == False')[['Nome', 'Sexo', 'Idade']]
reprovados

     Nome Sexo  Idade
1   Cátia    F     27
2   Denis    M     56
6  Carlos    M     19
7   Alice    F     35

In [41]:
# Crie uma visualização com os três alunos mais novos.
tres_mais_novos = alunos.sort_values(by='Idade',)
tres_mais_novos.iloc[:3]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True

## (EXTRA IV) Formas de seleção

In [42]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [43]:
#todo DataFrame
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [44]:
#apenas uma coluna
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [45]:
#retorna uma series
type(df['c1'])

pandas.core.series.Series

In [46]:
#duas colunas
df[['c1', 'c2']]

    c1  c2
l1   1   2
l2   5   6
l3   8  10
l4  13  14

In [47]:
#retorna um DataFrame
type(df[['c1', 'c2']])

pandas.core.frame.DataFrame

In [48]:
#por index
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [49]:
#por index e coluna
df[1:][['c1', 'c2']]

    c1  c2
l2   5   6
l3   8  10
l4  13  14

In [50]:
# por linha
df.loc['l3']

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [51]:
#por linha e coluna
df.loc['l3', 'c2']

10

In [52]:
#essa função faz o mesmo que a outra, mas faz com indice numerico
df.iloc[1, 2]

7